<a href="https://colab.research.google.com/github/Kostya-meow/PIS_colab/blob/main/PIS_03_03_2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#  import packages

In [3]:
import pandas as pd
import numpy as np
from IPython.display import display

# Data

In [9]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)

data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [12]:
names = ['Id','RI','Na','Mg','Al','Si','K','Ca','Ba','Fe','Class']
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [16]:
data['Class'].replace({1:'building_windows_float',
                     2:'building_windows_non_float',
                     3:'vehicle_windows_float',
                     4:'vehicle_windows_non_float',
                     5:'containers',
                     6:'tableware',
                     7:'headlamps'}, inplace=True)
data['Class'].value_counts()

building_windows_non_float    76
building_windows_float        70
headlamps                     29
vehicle_windows_float         17
containers                    13
tableware                      9
Name: Class, dtype: int64

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      214 non-null    float64
 1   Na      214 non-null    float64
 2   Mg      214 non-null    float64
 3   Al      214 non-null    float64
 4   Si      214 non-null    float64
 5   K       214 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [20]:
for col in data.columns:
    fr = np.random.randint(5,10)/100
    data.loc[data.sample(frac=fr).index,col] = np.nan

In [21]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      199 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      199 non-null    float64
 3   Al      199 non-null    float64
 4   Si      195 non-null    float64
 5   K       197 non-null    float64
 6   Ca      203 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   197 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

# Data Vizual

In [22]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      199 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      199 non-null    float64
 3   Al      199 non-null    float64
 4   Si      195 non-null    float64
 5   K       197 non-null    float64
 6   Ca      203 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   197 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [23]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  199.000000  199.000000  199.000000  ...  203.000000  199.000000  199.000000
mean     1.518431   13.396231    2.698191  ...    8.973596    0.172362    0.056482
std      0.003124    0.831829    1.433369  ...    1.452009    0.493961    0.098881
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516515   12.875000    2.140000  ...    8.235000    0.000000    0.000000
50%      1.517690   13.290000    3.480000  ...    8.610000    0.000000    0.000000
75%      1.519300   13.820000    3.605000  ...    9.205000    0.000000    0.090000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [26]:
print('-------------------------------------')
display(data['Class'].describe())
print('-------------------------------------')
display(data['Class'].value_counts())

-------------------------------------

count                            197
unique                             6
top       building_windows_non_float
freq                              71
Name: Class, dtype: object

-------------------------------------

building_windows_non_float    71
building_windows_float        63
headlamps                     25
vehicle_windows_float         17
containers                    13
tableware                      8
Name: Class, dtype: int64